20250614T125259--kdoc-394-manのシステムコールセクションはインストールされてないことがある__wiki.org
:properties:
:ID: 20250614T125259
:mtime:    20250624225149
:ctime:    20250614125302
:end:
#+title:      KDOC 394: manのシステムコールセクションはインストールされてないことがある
#+date:       [2025-06-14 Sat 12:52]
#+filetags:   :wiki:
#+identifier: 20250614T125259

* この文書のステータス
- 作成
  - [X] 2025-06-14 貴島
- レビュー
  - [X] 2025-06-24 貴島

* 概要

Linux Mint 22.1で、manで検索したときにシステムコールのセクションが見つからないことに気づいた。ディストリビュージョンによっては、省略されていることがあるという。

インストールする。

#+caption: manpages-devをインストールする
#+begin_src shell
sudo apt update
sudo apt install manpages-dev
#+end_src

#+begin_src shell
man 2 fork | head -n10
#+end_src

#+RESULTS:
#+begin_src
fork(2)                       System Calls Manual                      fork(2)

NAME
       fork - create a child process

LIBRARY
       Standard C library (libc, -lc)

SYNOPSIS
       #include <unistd.h>
#+end_src

* 関連
なし。
