20250614T125259--kdoc-394-manのシステムコールセクションはインストールされてないことがある__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:11:02Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 394: manのシステムコールセクションはインストールされてないことがある</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 394: manのシステムコールセクションはインストールされてないことがある</h1>
<div id="outline-container-orgd6d3670" class="outline-2">
<h2 id="orgd6d3670"><a href="#orgd6d3670">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgd6d3670">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-06-14 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-06-24 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6e69a8a" class="outline-2">
<h2 id="org6e69a8a"><a href="#org6e69a8a">概要</a></h2>
<div class="outline-text-2" id="text-org6e69a8a">
<p>
Linux Mint 22.1で、manで検索したときにシステムコールのセクションが見つからないことに気づいた。ディストリビュージョンによっては、省略されていることがあるという。
</p>

<p>
インストールする。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>manpages-devをインストールする</label><pre class="src src-shell">sudo apt update
sudo apt install manpages-dev
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">man 2 fork | head -n10
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">fork(2)                       System Calls Manual                      fork(2)

NAME
       fork - create a child process

LIBRARY
       Standard C library (libc, -lc)

SYNOPSIS
       #include &lt;unistd.h&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org59cf072" class="outline-2">
<h2 id="org59cf072"><a href="#org59cf072">関連</a></h2>
<div class="outline-text-2" id="text-org59cf072">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
